doom-config/Linux Mint/config.org
#+title: Config

* Table of Contents :toc:
- [[#meta][Meta]]
  - [[#zotero][Zotero]]
  - [[#latex-con-miktex][Latex con Miktex]]
  - [[#image-magick][Image Magick]]
  - [[#mayúsculas-dobles][Mayúsculas dobles]]
  - [[#xclip][Xclip]]
  - [[#nerd-icons][Nerd icons]]
  - [[#pdf-tools][Pdf Tools]]
  - [[#nodejs-y-pagefind][Node.js y Pagefind]]
  - [[#entornos-virtuales-y-pipx][Entornos virtuales y pipx]]
- [[#general-emacs-config][General Emacs Config]]
  - [[#servidor-de-emacs][Servidor de Emacs]]
  - [[#ventana-maximizada-al-abrir][Ventana Maximizada al abrir.]]
  - [[#path][Path]]
- [[#doom-emacs-config][Doom Emacs Config]]
- [[#org-mode][Org-Mode]]
  - [[#org-agenda][Org-Agenda]]
  - [[#org-journal][Org-Journal]]
  - [[#imágenes][Imágenes]]
  - [[#latex][Latex]]
  - [[#org-publish][Org-publish]]
  - [[#org-noter][Org-noter]]
- [[#biblio-para-bibliografía][Biblio para bibliografía]]
- [[#pdf-tools-1][PDF-Tools]]
- [[#python][Python]]
  - [[#entornos-virtuales][Entornos virtuales]]
  - [[#consola-interactiva][Consola interactiva]]
  - [[#encoding][Encoding]]

* Meta
Esta sección está dedicada a programas adicionales por fuera de Emacs.

** Zotero
Para manejar mi bibliografía utilizo la aplicación Zotero. Ssumada a esta utilizo los plugins de:
- BetterBibTeX: sirve para generar archivos de bibliografía en latex que se exporten automáticamente a =~/Org= y que puedan ser utilizados por Emacs.
- Zotmoov: sirve para mover/copiar los archivos descargados en Zotero, auqnue de momento está solo utilizado en Windows.

Para sincronizar mi biblioteca uso el servicio de Zotero y para sincronizar los archivos adjuntos utilizo el servicio de WebDavs de Koofr.

** Latex con Miktex
Para poder previsualizar (o eventualmente compilar archivos =.tex=) es necesario una instalación de Latex. En general para Linux suele utilizarse TexLive, pero conociendo Miktex de Windows usaré esta opción. Tiene la ventaja de ser una instalación mucho más liviana con la posibilidad de habilitar la instalación de paquetes /on the fly/ cuando sean necesarios, manteniendo el mínimo e indispensable instalado.

Para la instalación seguí las instrucciones de [[https://miktex.org/download]] para Linux Mint 22. La única particularidad es que al correr el =sudo apt-get update= tira un warning por la arquitectura "i386" de 32 bits. Se puede quitar la warning modificando con

#+begin_src bash :tangle no
sudo nano /etc/apt/sources.list.d/miktex.list
#+end_src

El contenido por lo siguiente:

#+begin_src conf :tangle no
deb [arch=amd64 signed-by=/usr/share/keyrings/miktex.gpg] https://miktex.org/download/ubuntu noble universe
#+end_src

Y realicé la instalación privada (en mi usuario) con la opción de instalar paquetes /on the fly/ habilitada. Finalizar el setup con:

#+begin_src bash :tangle no
miktexsetup finish
initexmf --set-config-value [MPM]AutoInstall=1
#+end_src

Además de usar la =MikTeX Console= para chequear por updates de paquetes.

** Image Magick
Para poder pegar imágenes sencillamente desde el clipboard en Org-mode utilizamos Image Magick. En Linux Mint es tan sencillo como correr:

#+begin_src bash :tangle no
sudo apt install imagemagick
#+end_src

Aaparece como =convert= en vez de =magick=. Aparentemente de todos modos esto solo es necesario en Windows.

** Mayúsculas dobles
Esto es una cuestión general de Linux aparentemente, pero al poner las mayúsculas con BloqMayús demasiado rápido hay un pequeño delay en la desactivación y esto resulta en más de una letra con maypusucla. Por ejemplo, al escribir "Ya" escribiría "YA". Para solucionar esto definitivamente tengo un script que se corre al inicio que saca el delay: =/home/ignacio/.config/autostart/capslock_fix.sh=.

El contenido es el siguiente:
#+begin_src bash :tangle no
#!/bin/bash

xkbcomp -xkb "$DISPLAY" - | sed 's#key <CAPS>.*#key <CAPS> {\
repeat=no,\
type[group1]="ALPHABETIC",\
symbols[group1]=[ Caps_Lock, Caps_Lock],\
actions[group1]=[ LockMods(modifiers=Lock),\
Private(type=3,data[0]=1,data[1]=3,data[2]=3)]\
};\
#' | xkbcomp -w 0 - "$DISPLAY"
#+end_src

Para que pueda ejecutarse al iniciar sesión fue necesario marcarlo como ejecutable:

#+begin_src bash :tangle no
chmod +x /home/ignacio/.config/autostart/capslock_fix.sh
#+end_src

La solución fue tomada de [[https://github.com/ACO-626/CapsLockDelay/blob/main/ACO-BloqMayusSolution][Github]]. Y está explicada en [[https://www.youtube.com/watch?v=v7XWlCFkj4A][Yutube]].

** Xclip
Para poder pegar imágenes desde el clipboard se podría utilizar xclip en lugar de Image Magick. Más allá de esto resulta indispensable para poder copiar imágenes desde el explorador de archivos. De querer hacer esto se instala con:

#+begin_src bash :tangle no
sudo apt install xclip
#+end_src

** Nerd icons
Para poder instalar los íconos que usa Doom Emacs usamos ~M-x nerd-icons-install-fonts~.

** Pdf Tools
Para poder usar pdftools debemos correr ~M-x pdf-tools-install~. Va a pedirnos hacerlo de todas maneras al querer abrir un PDF.  Además, para poder leer =djvu= y =epub= usamos:

#+begin_src bash :tangle no
sudo apt install djvulibre-bin
#+end_src

Con los paquetes de =nov= y =djvu= en =packages.el=.

** Node.js y Pagefind
Para indexar el contenido de los htmls exportados con =Org-publish= necesitamos =pagefind= de =Node.js=. Para esto lo instalamos:

#+begin_src bash :tangle no
sudo apt install nodejs npm
#+end_src

Y luego, al correr algún comando con =pagefind= nos preguntará si lo queremos instalar. Por ejemplo:

#+begin_src bash :tangle no
cd ~/Org && npx pagefind --site Lab-Journal-html --output-path Lab-Journal-html/pagefind
#+end_src

** Entornos virtuales y pipx
Para manjear herramientas usamos =pipx=, que descarga los paquetes, como =ipython=, =black=, =ruff= y =jupyter= basados en el python del sistema pero en entornos aislados, y que se mantiene accesibles desde cualquier =venv=.

#+begin_src bash :tangle no
sudo apt install pipx
#+end_src

Y luego de instalar paquetes hay que agregarlos al path como:

#+begin_src bash :tangle no
pipx install ipython
pipx ensurepath
#+end_src

Para manejar los =venv= de momento utilizo las propias rutinas de =python3=. O sea,

#+begin_src bash :tangle no
python3 -m venv .venv
source .venv/bin/activate
deactivate
#+end_src

Y una vez activado utilizo =pip= normalmente para instalar paquetes como =numpy=, =matplotlib= o =scipy=. Aunque si en algún momento quiero otras versiones de Python probablemente pase a =miniconda3=.

* General Emacs Config
La siguiente configuración fue escrita para funcionar en Linux Mint 22.3 con Cinnamon y Cinnamenu.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Servidor de Emacs
Para poder agilizar la carga de los frames de Emacs tengo configurado en las aplicaciones que se corren al inicio el lanzamiento de un =Daemon= de Emacs, de forma tal que luego cada vez que quiera abrir un frame alcance con generar un cliente, que se abre casi instantáneamente, ya que los paquetes se encuentran precargados:

#+begin_src bash :tangle no
/usr/bin/emacs --daemon
#+end_src

** Ventana Maximizada al abrir.
Lo ideal es que por defecto la ventana se abra maximizada.
#+begin_src emacs-lisp
;; (add-hook 'window-setup-hook #'toggle-frame-fullscreen) ;; Se abre ocupando toda la pantalla.
;; (set-frame-parameter nil 'fullscreen 'maximized)
(add-to-list 'initial-frame-alist '(fullscreen . maximized)) ;; Esto funciona para el Emacs, pero se ignora para el cliente con Daemon.
#+end_src

*** Solución para Cinnamon
Esto al final solo funciona al abrir Emacs tal cual (Sería la de GUI). Para que funcione con el cliente que abro desde el menú tuve que terminar cambiando el =Exec=. Quedó lo siguiente:
#+begin_src conf :tangle no
[Desktop Entry]
Name=Emacs (Client)
GenericName=Text Editor
Comment=Edit text
MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;x-scheme-handler/org-protocol;
Exec=sh -c 'if [ -n "$*" ]; then exec /usr/bin/emacsclient --alternate-editor= --reuse-frame -F "((fullscreen . maximized))" "$@"; else exec emacsclient --alternate-editor= --create-frame -F "((fullscreen . maximized))"; fi' sh %F
Icon=emacs
Type=Application
Terminal=false
Categories=Development;TextEditor;
StartupNotify=true
StartupWMClass=Emacs
Keywords=emacsclient;
Actions=new-window;new-instance;

[Desktop Action new-window]
Name=New Window
Exec=/usr/bin/emacsclient --alternate-editor= --create-frame -F '((fullscreen . maximized))'

[Desktop Action new-instance]
Name=New Instance
Exec=emacs %F
#+end_src

** Path
Aal lanzar Emacs desde el menú de aplicaciones aparentemente no se carga el PATH completo. Por esto agregamos =~/bin=.

#+begin_src emacs-lisp
(setenv "PATH" (concat (expand-file-name "~/bin") ":" (getenv "PATH")))
(add-to-list 'exec-path (expand-file-name "~/bin"))
#+end_src

Esto es relevante ya que MikTeX para tener prioridad sobre TexLive (que resulta que también está instalado) se coloca en =~/bin= como symlink a sus ejecutables. Por ejemplo, =dvipng= vive en =~/bin= como symlink a =~/usr/bin/miktex-dvipng=, y sin agregar esto al PATH no lo encuentra. Y esto pasa por haber elegido la instalación personal en vez de system wide.

Además, para poder usar =ipython= y =black= instalados con =pipx= hace falta incorporar lo siguiente:

#+begin_src emacs-lisp
(setenv "PATH" (concat (getenv "PATH") path-separator (expand-file-name "~/.local/bin")))
(add-to-list 'exec-path (expand-file-name "~/.local/bin"))
#+end_src

Ya que nuevamente Emacs, por lo menos lanzado desde Cinnamenu, no lo hereda.

* Doom Emacs Config
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

* Org-Mode
El directorio para todos mis archviso =.org= es:

#+begin_src emacs-lisp
(setq org-directory "~/Org/")
#+end_src

Éste se encuentra sincronizado con GitHub.

** Org-Agenda

Para tener más libertad a la hora de definir el estado de las tareas de la agenda conviene expandir las opciones disponibles:
#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"
           "NEXT(n)"
           "WAIT(w)"
           "|"
           "DONE(d)"
           "CANCELLED(c)"))))
#+end_src

Y para que =Org= parsee todos los archivos recursivamente, incluyendo las entradas del journal, en busca de tareas:
#+begin_src emacs-lisp
(after! org
  (defun my/refresh-agenda-files ()
    (setq org-agenda-files
          (directory-files-recursively org-directory "\\.org$")))
  (my/refresh-agenda-files)
  (add-hook 'org-agenda-mode-hook #'my/refresh-agenda-files))
#+end_src

** Org-Journal
Esta sección está dedicada a mi Journal diario personal. La estructura de archivos relevante al diario es la siguiente:

#+begin_src text :tangle no
Org/
├── Lab-Journal/
│   └── 2026/
│        ├── 05/
│        │   ├── week-21.org
│        │   └── otras-notas.org
│        └── 06/
├── Assets/
│   └── 2026/
│        ├── 05/
│        │   ├── Day_26/
│        │   │   └── imagen.png
│        │   └── Day_27/
│        └── 06/
└── references.bib
#+end_src


Todas las entradas, ya sea semanales o auxiliares, se encuentran dentro del directorio =Lab-Journal= en subdirectorios organizados por mes y año. Todas las imágenes insertadas se encuentran dentro de =Assets= organizadas por día, mes y año.

Finalmente se encuentra el archivos de referencias bibliográficas, =references.bib=, exportado y mantenido automáticamente desde Zotero por BetterBibTeX.

*** Entradas semanales
La idea es tener una entrada =.org= en el journal por semana. Para encontrar el nombre de la entrada para la semana actual usamos:

#+begin_src emacs-lisp
(defun my/journal--week-file ()
  (let* ((year (format-time-string "%Y"))
         (month (format-time-string "%m"))
         (week (format-time-string "%V"))
         (dir (expand-file-name (concat "Lab-Journal/" year "/" month) org-directory))
         (file (expand-file-name (format "week-%s.org" week) dir)))
    (unless (file-directory-p dir)
      (make-directory dir t))
    file))
#+end_src

De ser necesario se crea la entrada, colocando el header necesario:

#+begin_src emacs-lisp
(defun my/journal--ensure-file ()
  (let ((file (my/journal--week-file)))
    (unless (file-exists-p file)
      (with-temp-file file
        (insert (format "#+TITLE: Journal Week %s\n#+OPTIONS: toc:2\n#+BIBLIOGRAPHY: ../../../references.bib\n#+CITE_EXPORT: csl chicago-author-date.csl\n\n* Table of Contents :TOC:noexport:\n\n* Referencias\n#+PRINT_BIBLIOGRAPHY:\n"
                        (format-time-string "%V")))))
    file))
#+end_src

La estructura del =Header= es:
- Tïtulo: número de semana dentro del año.
- El flag para generar una tabla de contenidos al exportar la entrada como html.
- El path al archivo de referencias, también para la exportación a html.
- El formato para la citas insertadas al exportar a html.
- La tabla de contenidos que se muestra al editar en Emacs (sin exportar).
- La sección con la bibliografía que se genera automáticamente al exportar a html.

