doom-config/Linux Mint/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; (add-hook 'window-setup-hook #'toggle-frame-fullscreen) ;; Se abre ocupando toda la pantalla.
;; (set-frame-parameter nil 'fullscreen 'maximized)
(add-to-list 'initial-frame-alist '(fullscreen . maximized)) ;; Esto funciona para el Emacs, pero se ignora para el cliente con Daemon.

(setenv "PATH" (concat (expand-file-name "~/bin") ":" (getenv "PATH")))
(add-to-list 'exec-path (expand-file-name "~/bin"))

(setenv "PATH" (concat (getenv "PATH") path-separator (expand-file-name "~/.local/bin")))
(add-to-list 'exec-path (expand-file-name "~/.local/bin"))

(setq doom-theme 'doom-one)

(setq display-line-numbers-type t)

(setq org-directory "~/Org/")

(after! org
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"
           "NEXT(n)"
           "WAIT(w)"
           "|"
           "DONE(d)"
           "CANCELLED(c)"))))

(after! org
  (defun my/refresh-agenda-files ()
    (setq org-agenda-files
          (directory-files-recursively org-directory "\\.org$")))
  (my/refresh-agenda-files)
  (add-hook 'org-agenda-mode-hook #'my/refresh-agenda-files))

(defun my/journal--week-file ()
  (let* ((year (format-time-string "%Y"))
         (month (format-time-string "%m"))
         (week (format-time-string "%V"))
         (dir (expand-file-name (concat "Lab-Journal/" year "/" month) org-directory))
         (file (expand-file-name (format "week-%s.org" week) dir)))
    (unless (file-directory-p dir)
      (make-directory dir t))
    file))

(defun my/journal--ensure-file ()
  (let ((file (my/journal--week-file)))
    (unless (file-exists-p file)
      (with-temp-file file
        (insert (format "#+TITLE: Journal Week %s\n#+OPTIONS: toc:2\n#+BIBLIOGRAPHY: ../../../references.bib\n#+CITE_EXPORT: csl chicago-author-date.csl\n\n* Table of Contents :TOC:noexport:\n\n* Referencias\n#+PRINT_BIBLIOGRAPHY:\n"
                        (format-time-string "%V")))))
    file))

(defun my/journal--goto-day ()
