doom-config/Linux Mint/config.org
*** Entradas diarias
Dentro de cada semana tenemos un top-level heading correspondiente a cada día, que se genera una única vez, al querer ingresar a la entrada semanal ese día mediante cualquier método.

#+begin_src emacs-lisp
(defun my/journal--goto-day ()
  (let ((day (format-time-string "%Y-%m-%d")))
    (goto-char (point-min))
    (unless (re-search-forward (concat "^\\* " day) nil t)
      (goto-char (point-max))
      (insert (format "\n* %s\n" day)))
    (re-search-backward (concat "^\\* " day))))
#+end_src

El formato de esta entrada es =2026-05-27=.

*** Formas de agregar información a la entrada semanal
Hay distintos métodos para acceder y agregar información a la entrada semanal.

**** Entrada rápida
Apendea al final de la entrada un sub-level heading correspondiente a la hora

#+begin_src emacs-lisp
(defun my/journal-add-entry ()
  (interactive)
  (my/journal-open)
  (my/journal--goto-day)
  (goto-char (point-max))
  (insert (format "\n** [%s] \n" (format-time-string "%H:%M")))
  (save-buffer))
#+end_src

Con formato =[08:10]=.

**** Captura rápida
Usando el paquete de =Org-capture= la idea es que al estar editando archivos pueda generar una entrada rápida en el diario, sin necesidad de salir del archivo, con un link que haga referencia a la posición donde me econtraba al generar esa captura. Para esto se abre un mini-buffer debejo en el cuál poder escribir la información, y se apendea como una entrada rápida con el timestamp de la hora en que se generó.

#+begin_src emacs-lisp
(defun my/journal-capture-target ()
  "Target location for journal captures."
  (set-buffer (find-file-noselect (my/journal--ensure-file)))
  (my/journal--goto-day)
  (goto-char (point-max)))

(after! org
  (setq org-capture-templates
        (append
         (cl-remove-if (lambda (x) (equal (car x) "j"))
                       org-capture-templates)
         '(("j" "Journal capture (context)"
            plain
            (file+function
             my/journal--week-file
             my/journal-capture-target)
            "** [%<%H:%M>] \n %?\n  %a\n"
            :empty-lines 1)))))

(defun my/journal-capture ()
  "Org-capture journal entry with context."
  (interactive)
  (org-capture nil "j"))
#+end_src

**** Sólo apertura
Para simplemente acceder a la entrada diaria sin necesidad de agregar información:

#+begin_src emacs-lisp
(defun my/journal-open ()
  "Open weekly journal and jump to today."
  (interactive)
  (find-file (my/journal--ensure-file))
  (my/journal--goto-day))
#+end_src

*** Sincronización con Github
La idea es poder sincronizar el journal rápidamente con Github, sin necesidad del detalle que permite el paquete =Magit=. Para esto definimos un template que agrega todos los cambios con un mensaje de commit automático y los pushea al repositorio:

#+begin_src emacs-lisp
(defun my/journal-sync ()
  (interactive)
  (let ((default-directory org-directory))
    (async-shell-command
     "git add . && git diff --cached --quiet || git commit -m \"Auto commit of Lab-Journal\" && git push")))
#+end_src

Además, por si acaso de que no hubiese conexión y sólo faltase realizar el pusheo se logra con =git diff --cached --quiet=.

*** Keybindings
Los keybings relacionados al journal empiezan con el prefijo de ~SPC n j~ y son los siguientes:

#+begin_src emacs-lisp
(after! org
    (map! :leader
        (:prefix ("n j" . "journal")
        :desc "Fast journal entry" "j" #'my/journal-add-entry
        :desc "Open journal" "o" #'my/journal-open
        :desc "Capture journal entry" "c" #'my/journal-capture
        :desc "Journal sync" "g" #'my/journal-sync)))
#+end_src

Con las funcionalidades:

|-----------+-----------------------+--------------------------------------------|
| Teclas    | Acción                | Descripción                                |
|-----------+-----------------------+--------------------------------------------|
| ~SPC n j j~ | Entrada rápida        | Agrega entrada rápida con timestamp.       |
| ~SPC n j c~ | Captura rápida        | Captura con contexto via org-capture.      |
| ~SPC n j o~ | Aapertura del journal | Abre el archivo de la semana actual.       |
| ~SPC n j g~ | Sincronización Github | git add + commit + push del =org-directory=. |
|-----------+-----------------------+--------------------------------------------|
** Imágenes

*** Preview de imágenes
Queremos que se cargue automáticamente la previsualización de imágenes en =Org-mode=:
#+begin_src emacs-lisp
(setq org-startup-with-inline-images t)
#+end_src

Y que si no está especificado el tamaño que sea de 500 px.
#+begin_src emacs-lisp
(setq org-image-actual-width '(500))
#+end_src

Hay que tener en cuenta que este ajuste está en =px= con lo cual va a variar de monitor en monitor.

*** Copiado de imágenes
Esta sección la usamos para poder copiar imágenes desde el clipboard, ya sean imágenes copiadas directamente, como capturas de pantallas (totales o parciales) o referencias a imágenes copiadas desde el explorador de archivos.

**** Directorio de Assets

Las imágenes se pegan en =Org/Assets= y se organizan por día, mes y año.
#+begin_src emacs-lisp
(after! org
  (defun my/org-download-dir ()
  (let ((dir (expand-file-name
              (format-time-string "%Y/%m/Day_%d")
              (expand-file-name "Assets" org-directory))))
      (make-directory dir t)
      dir)))
#+end_src

**** Copiado de imágenes
Al copiar una imagen, por ejemplo de una captura de pantalla, se puede pegar en =Org-mode= utilizando =xclip=.

#+begin_src emacs-lisp
(after! org
  (defun my/org-download-clipboard ()
    "Paste clipboard image into Assets folder with custom name."
    (interactive)
    (let* ((dir (my/org-download-dir))
            (name (read-string "Image name: "))
            (safe-name
            (replace-regexp-in-string
            "[^a-zA-Z0-9_-]" "_" name))
            (filepath (expand-file-name (format "%s.png" safe-name) dir))
            (width (string-to-number
                    (read-string "Width: " "500")))
            (result (call-process "xclip" nil `(:file ,filepath) nil
                                "-selection" "clipboard"
                                "-t" "image/png"
                                "-o")))
        (if (and (= result 0) (file-exists-p filepath))
            (progn
            (insert (format "#+ATTR_ORG: :width %d\n[[file:%s]]\n"
                            width
                            (file-relative-name filepath
                                                (file-name-directory buffer-file-name))))
            (org-display-inline-images))
        (message "Error: no se pudo guardar la imagen del clipboard")))))
#+end_src

Al intentar pegarla pedirá:
- =Image name= (sin necesidad de poner una extensión al final). Se van a borrar tildes y otros caracteres que no sean puramente alfanuméricos.
- =Width= que por defecto será 500 px.


**** Copiado de imágenes por referencia
Es posible además pegar imágenes copiándolas desde el explorador de archivos, también utilizando =xclip=.

#+begin_src emacs-lisp
(after! org
  (defun my/org-copy-images-from-files ()
    "Copy image files from file manager clipboard into Assets folder."
    (interactive)
    (let* ((dir (my/org-download-dir))
           (raw (shell-command-to-string
                 "xclip -selection clipboard -t text/uri-list -o"))
           (uris (cl-remove-if #'string-empty-p
                               (split-string (string-trim raw) "\n")))
           (_ (unless uris
                (error "No hay archivos en el clipboard")))
           (sources (mapcar (lambda (uri)
                              (string-remove-prefix "file://" uri))
                            uris)))
      (dolist (source sources)
        (when (file-exists-p source)
          (let* ((name (read-string
                        "Image name: "
                        (file-name-sans-extension
                         (file-name-nondirectory source))))
                 (safe-name
                  (replace-regexp-in-string
                   "[^a-zA-Z0-9_-]" "_" name))
                 (width (string-to-number
                         (read-string "Width: " "500")))
                 (filepath (expand-file-name
                            (format "%s.png" safe-name) dir)))
            (copy-file source filepath t)
            (insert (format "#+ATTR_ORG: :width %d\n[[file:%s]]\n"
                            width
                            (file-relative-name
                             filepath
                             (file-name-directory buffer-file-name)))))))
      (org-display-inline-images))))
#+end_src

Esta función loopea sobre todas las imágenes que se hayan copiado, aunque funciona perfectamente en el caso de una sola.
Al intentar pegarla/s pedirá para cada una:
- =Image name= (sin necesidad de poner una extensión al final). Toma por defecto el nombre original de la imagen. Se van a borrar tildes y otros caracteres que no sean puramente alfanuméricos.
- =Width= que por defecto será 500 px.

**** Keybindings
Los keybindings relacionados a insertar imágenes son los siguientes:

#+begin_src emacs-lisp
(map! :leader
    :desc "Paste clipboard image"  "i p" #'my/org-download-clipboard
    :desc "Copy images from files" "i f" #'my/org-copy-images-from-files)
#+end_src

Con las funcionalidades:

|---------+-----------------+------------------------------------------------------|
| Teclas  | Acción          | Descripción                                          |
|---------+-----------------+------------------------------------------------------|
| ~SPC i p~ | Pega imágenes   | Inserta la imágen y la guarda en Assets.             |
| ~SPC i f~ | Pega referencia | Copia imágenes por referencia a su nombre en Assets. |
|---------+-----------------+------------------------------------------------------|

** Latex
Para la previsualización usamos =dvipng=, más rápido que =dvisvg=:

#+begin_src emacs-lisp
(after! org
  (setq org-preview-latex-default-process 'dvipng))
#+end_src

***  Previsualización automática
Existe la posibilidad de que al escribir latex se previsualice automáticamente, pero todavía es relativamenet lento esto con lo cual queda desactivado por ahora.

#+begin_src emacs-lisp
;; (use-package! org-fragtog
;;    :after org
;;    :hook (org-mode . my/org-fragtog-setup))

;;  (defun my/org-fragtog-setup ()
;;    (org-latex-preview '(16))
;;    (org-fragtog-mode 1))
#+end_src

** Org-publish
Para exportar automáticamente a una página web el Lab-Journal utilizamos =Org-publish=. Esta página web estática está en el =/root= de =/Org= con lo cual se puede cargar usando =Github Pages=.

