doom-config/Linux Mint/config.el
  (let ((day (format-time-string "%Y-%m-%d")))
    (goto-char (point-min))
    (unless (re-search-forward (concat "^\\* " day) nil t)
      (goto-char (point-max))
      (insert (format "\n* %s\n" day)))
    (re-search-backward (concat "^\\* " day))))

(defun my/journal-add-entry ()
  (interactive)
  (my/journal-open)
  (my/journal--goto-day)
  (goto-char (point-max))
  (insert (format "\n** [%s] \n" (format-time-string "%H:%M")))
  (save-buffer))

(defun my/journal-capture-target ()
  "Target location for journal captures."
  (set-buffer (find-file-noselect (my/journal--ensure-file)))
  (my/journal--goto-day)
  (goto-char (point-max)))

(after! org
  (setq org-capture-templates
        (append
         (cl-remove-if (lambda (x) (equal (car x) "j"))
                       org-capture-templates)
         '(("j" "Journal capture (context)"
            plain
            (file+function
             my/journal--week-file
             my/journal-capture-target)
            "** [%<%H:%M>] \n %?\n  %a\n"
            :empty-lines 1)))))

(defun my/journal-capture ()
  "Org-capture journal entry with context."
  (interactive)
  (org-capture nil "j"))

(defun my/journal-open ()
  "Open weekly journal and jump to today."
  (interactive)
  (find-file (my/journal--ensure-file))
  (my/journal--goto-day))

(defun my/journal-sync ()
  (interactive)
  (let ((default-directory org-directory))
    (async-shell-command
     "git add . && git diff --cached --quiet || git commit -m \"Auto commit of Lab-Journal\" && git push")))

(after! org
    (map! :leader
        (:prefix ("n j" . "journal")
        :desc "Fast journal entry" "j" #'my/journal-add-entry
        :desc "Open journal" "o" #'my/journal-open
        :desc "Capture journal entry" "c" #'my/journal-capture
        :desc "Journal sync" "g" #'my/journal-sync)))

(setq org-startup-with-inline-images t)

(setq org-image-actual-width '(500))

(after! org
  (defun my/org-download-dir ()
  (let ((dir (expand-file-name
              (format-time-string "%Y/%m/Day_%d")
              (expand-file-name "Assets" org-directory))))
      (make-directory dir t)
      dir)))

(after! org
  (defun my/org-download-clipboard ()
    "Paste clipboard image into Assets folder with custom name."
    (interactive)
    (let* ((dir (my/org-download-dir))
            (name (read-string "Image name: "))
            (safe-name
            (replace-regexp-in-string
            "[^a-zA-Z0-9_-]" "_" name))
            (filepath (expand-file-name (format "%s.png" safe-name) dir))
            (width (string-to-number
                    (read-string "Width: " "500")))
            (result (call-process "xclip" nil `(:file ,filepath) nil
                                "-selection" "clipboard"
                                "-t" "image/png"
                                "-o")))
        (if (and (= result 0) (file-exists-p filepath))
            (progn
            (insert (format "#+ATTR_ORG: :width %d\n[[file:%s]]\n"
                            width
                            (file-relative-name filepath
                                                (file-name-directory buffer-file-name))))
            (org-display-inline-images))
        (message "Error: no se pudo guardar la imagen del clipboard")))))

(after! org
  (defun my/org-copy-images-from-files ()
    "Copy image files from file manager clipboard into Assets folder."
    (interactive)
    (let* ((dir (my/org-download-dir))
           (raw (shell-command-to-string
                 "xclip -selection clipboard -t text/uri-list -o"))
           (uris (cl-remove-if #'string-empty-p
                               (split-string (string-trim raw) "\n")))
           (_ (unless uris
                (error "No hay archivos en el clipboard")))
           (sources (mapcar (lambda (uri)
                              (string-remove-prefix "file://" uri))
                            uris)))
      (dolist (source sources)
        (when (file-exists-p source)
          (let* ((name (read-string
                        "Image name: "
                        (file-name-sans-extension
                         (file-name-nondirectory source))))
                 (safe-name
                  (replace-regexp-in-string
                   "[^a-zA-Z0-9_-]" "_" name))
                 (width (string-to-number
                         (read-string "Width: " "500")))
                 (filepath (expand-file-name
                            (format "%s.png" safe-name) dir)))
            (copy-file source filepath t)
            (insert (format "#+ATTR_ORG: :width %d\n[[file:%s]]\n"
                            width
                            (file-relative-name
                             filepath
                             (file-name-directory buffer-file-name)))))))
      (org-display-inline-images))))

(map! :leader
    :desc "Paste clipboard image"  "i p" #'my/org-download-clipboard
    :desc "Copy images from files" "i f" #'my/org-copy-images-from-files)

(after! org
  (setq org-preview-latex-default-process 'dvipng))

;; (use-package! org-fragtog
;;    :after org
;;    :hook (org-mode . my/org-fragtog-setup))

;;  (defun my/org-fragtog-setup ()
;;    (org-latex-preview '(16))
;;    (org-fragtog-mode 1))

(after! org
