doom-config/Linux Mint/config.org
*** Links rotos
Para ignorar los links a las fechas en los toc al exportar el Journal. De todas maneras al exportarse entonces aparecen como =*]=. Esto se soluciona al sacar la exportación del toc y dejando el argumento de toc 2 en el header.

#+begin_src emacs-lisp
(after! org
  (setq org-export-with-broken-links t))
#+end_src

*** Exportación automática
Ahora para exportar automáticamente a Git Pages con Org-publish:

#+begin_src emacs-lisp
(after! org
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(
          ("lab-journal"
           :base-directory "~/Org/Lab-Journal/"
           :base-extension "org"
           :publishing-directory "~/Org/Lab-Journal-html/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :with-author nil
           :with-creator nil
           :with-toc t
           :section-numbers nil
           :time-stamp-file nil
           :html-head-include-default-style nil
           :html-head-include-scripts nil
           :html-head "<link rel='stylesheet' href='../../../style.css' />
<script defer src='../../../script.js'></script>"
           :auto-sitemap t
           :sitemap-filename "index.org"
           :sitemap-title "Lab Journal"
           :sitemap-style list
           :sitemap-sort-files anti-chronologically))))
#+end_src

Esta función define el Header de los .htmls que se van a generar. Por cada archivo .org en =/Lab-Journal= se va a crear un equivalente en html en el directorio =/Lab-Journal-html=. De esta forma, al estar ambos en el root, la estructura de links relativos a los Assets es la misma. Idealmente tendríamos los Assets dentro de =/Lab-Journal-html= con los archivos org haciendo referencia a ellos y así luego sólo exponer esa carpeta en Github Pages (usando =/docs= en lugar de =/root=). En cualquiera de los dos casos la ventaja de no tener Assets dentro de =/Lab-Journal= como tenía originalmente es que así se evita la duplicación de los Assets al exportar.

El Header de cada entrada html contiene la referencia al .css y .js que dan el formato y funcionamiento a la página en cada entrada. Luego, tenemos un =index.html= automático que genera =Org-publish= con las entradas en =/Lab-Journal-html=, pero al generar la página desde =/root= necesitamos además otro =index.html= que lea Github para hacer referencia al automático.

Luego se ejecuta:

#+begin_src emacs-lisp
(after! org
  (defun my/lab-journal-generate-index ()
    "Genera search-index.json en el root del repo."
    (let* ((docs-dir (expand-file-name "~/Org/Lab-Journal-html/"))
           (output-file (expand-file-name "~/Org/search-index.json"))
           (files (directory-files-recursively docs-dir "\\.html$"))
           (entries
            (delq nil
                  (mapcar
                   (lambda (file)
                     (let* ((rel (file-relative-name file (expand-file-name "~/Org/")))
                            (parts (split-string rel "/"))
                            (year  (and (>= (length parts) 4) (nth 1 parts)))
                            (month (and (>= (length parts) 4) (nth 2 parts)))
                            (name  (file-name-sans-extension (file-name-nondirectory file)))
                            (title (replace-regexp-in-string "[-_]" " " name)))
                       (when (and year month
                                  (not (string= name "index")))
                         (format "{\"title\":\"%s\",\"url\":\"%s\",\"year\":\"%s\",\"month\":\"%s\"}"
                                 title rel year month))))
                   files))))
      (with-temp-file output-file
        (insert "[" (mapconcat #'identity entries ",") "]"))))
#+end_src

Esta segunda función indexa las entradas de =/Lab-Journal-html= en un .json para poder facilitar su búsqueda posteriormente en la página web.

*** La estructura de archivos

La estructura final del repositorio entonces sería:
#+begin_src text :tangle no
Org/
├── Lab-Journal/
│   ├── 2026/05/week-21.org
│   └── index.org
├── Lab-Journal-html/
│   ├── 2026/05/week-21.html
│   ├── pagefind/
│   └── index.html
├── Assets/
│   └── 2026/05/Day_26/imagen.png
├── index.html
├── style.css
├── script.js
├── search-index.json
└── references.bib
#+end_src

Los comandos de publicación custom además indexan las entradas html usando =pagenfind= y =Node.js= para poder tener un buscador en la página. Todo el contenido de este proceso se guarda en =/Lab-Journal-html/pagefind=.

**** index.html
El =index.html= del =/root= hace referencia al =/Lab-Journal-html/index.html= generado automáticamente con =Org-publish=. Además carga el estilo del índice y el buscador en la landing page de la página. Para el buscador aprovecha la lógica del buscador propio de =pagefind=.

**** style.css
Da el estilo general de cada entrada.

**** script.js
Agrega funcionalidades extra dentro de cada entrada, en este caso lo único que hace de momento es aumentar las imágenes a la ventana completa al hacerles click.

**** seach-index.json
Listado de las entradas html para la el índice y ls búsqueda en la landing page.

*** Exportación de bibliografía
Para exportar los links a la bibliografía insertados con  =citar= u =org= utilizamos los siguiente.

#+begin_src emacs-lisp
(after! org
  (require 'oc-csl)
  (setq org-cite-global-bibliography '("~/Org/references.bib"))
  (setq org-cite-export-processors
        '((html . (csl "chicago-author-date.csl"))
          (t    . (csl "chicago-author-date.csl"))))
  (setq org-cite-csl-styles-dir "~/Zotero/styles/"))
#+end_src

Aunque todavía no verifiqué si esto hace algo más por sobre lo que aclaro en los headers de los =.org=.

*** Comando de actualización de la página web
Para automatizar la publicación de la paǵina definimos los siquientes comandos. Eeeen primer lugar el siguiente corre =Org-publish= y =pagefind= y exporta todos los cambios a Github.
#+begin_src emacs-lisp
(defun my/lab-journal-export-and-push ()
  (interactive)
  (save-some-buffers t)
  (org-publish "lab-journal")
  (my/lab-journal-generate-index)
  (async-shell-command
   (concat
    "cd " (expand-file-name org-directory) " && "
    "npx pagefind --site Lab-Journal-html --output-path Lab-Journal-html/pagefind && "
    "git add . && "
    "git diff --cached --quiet || "
    "(git commit -m \"Auto export for the Lab Journal.\" && git push)")))
#+end_src

*** Comando de rebuild de la página web
Esta segunda versión hace un full rebuild del proyecto por si acaso, aunque no lo exporta a Github.
#+begin_src emacs-lisp
(defun my/lab-journal-full-rebuild ()
  (interactive)
  (org-publish-remove-all-timestamps)
  (org-publish "lab-journal" t)
  (my/lab-journal-generate-index)
  (async-shell-command
   (concat
    "cd " (expand-file-name org-directory) " && "
    "npx pagefind --site Lab-Journal-html --output-path Lab-Journal-html/pagefind")))
#+end_src

*** Keybindings
Los keybindings correspondiente a este proceso son los siguientes:
#+begin_src emacs-lisp
(map! :leader
        :prefix ("n j" . "journal")
        :desc "Export Lab Journal"
        "p" #'my/lab-journal-export-and-push
        :desc "Full rebuild Lab Journal"
        "R" #'my/lab-journal-full-rebuild))
#+end_src

Con las funcionalidades:

|-----------+-----------------+-----------------------------------------------------------|
| Teclas    | Acción          | Descripción                                               |
|-----------+-----------------+-----------------------------------------------------------|
| ~SPC n j p~ | Publica Journal | Hace =Org-publish= sobre =/Lab-Journal= + pagefind + commit . |
| ~SPC n j R~ | Rebuild Journal | Hace rebuild con =/Org-publish= + pagefind.                 |
|-----------+-----------------+-----------------------------------------------------------|
** Org-noter
Configuramos el directorio para las notas de PDFs.

#+begin_src emacs-lisp
(setq org-roam-directory "~/Org")

(after! org-noter
  (setq org-noter-notes-search-path '("~/Org/Notes/References")
        org-noter-auto-save-last-location t
        org-noter-doc-split-fraction '(0.6 . 0.4)  ; PDF izquierda, notas derecha
        org-noter-always-create-frame nil
        org-noter-kill-frame-at-session-end nil))
#+end_src

* Biblio para bibliografía
Esta sección es para el manejo de la bibliografía utilizando =citar= para interpretar el =references.bib= exportado automáticamente con BetterBibTeX de Zotero. Intenté utilizar el propio paquete de =citar= para la toma de notas pero de momento lo que mejor funciona es con el ODF abierto lanzar una sesión de =Org-noter=.

#+begin_src emacs-lisp
(after! citar
  (setq citar-bibliography '("~/Org/references.bib")) ;; Tu .bib exportado por Zotero
  (setq citar-library-paths '("~/Zotero/storage")) ;; Donde Zotero guarda los PDFs
  (setq citar-notes-paths '("~/Org/Notes/References")) ;; Donde se crearán/guardarán las notas de org-noter
  (setq citar-file-note-org-include '(org-id org-noter-document-property))) ;; Formato del nombre del archivo de nota

(after! (citar org-noter)
  ;; Función que crea la nota con el template correcto para org-noter
  (defun my/citar-open-noter (citekey)
    "Abre o crea una nota org-noter para CITEKEY."
    (let* ((entry (citar-get-entry citekey))
           (title (citar-get-value "title" entry))
           (file  (expand-file-name
                   (concat citekey ".org")
                   "~/Org/Notes/References"))
           (pdf   (car (citar-get-files citekey))))
      (find-file file)
      (when (= (buffer-size) 0)
        ;; Crea el archivo con el header de org-noter si no existe
        (insert (format "#+title: %s\n#+author: \n\n* %s\n:PROPERTIES:\n:NOTER_DOCUMENT: %s\n:END:\n\n"
                        title title (or pdf ""))))
      (org-noter)))

  ;; Reemplaza la acción de "abrir nota" en citar por la nuestra
  (setq citar-open-note-function #'my/citar-open-noter))

(after! citar
  (setq completion-ignore-case t))
#+end_src

* PDF-Tools
Para las PDF-Tools en Linux Mint están soportadas nativamente, así que solo configuramos que se abra ocupando la ventana completa:
#+begin_src emacs-lisp
(after! pdf-tools
  (setq-default pdf-view-display-size 'fit-page))
#+end_src

* Python
