doom-config/Linux Mint/config.el
  (setq org-export-with-broken-links t))

(after! org
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(
          ("lab-journal"
           :base-directory "~/Org/Lab-Journal/"
           :base-extension "org"
           :publishing-directory "~/Org/Lab-Journal-html/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :with-author nil
           :with-creator nil
           :with-toc t
           :section-numbers nil
           :time-stamp-file nil
           :html-head-include-default-style nil
           :html-head-include-scripts nil
           :html-head "<link rel='stylesheet' href='../../../style.css' />
<script defer src='../../../script.js'></script>"
           :auto-sitemap t
           :sitemap-filename "index.org"
           :sitemap-title "Lab Journal"
           :sitemap-style list
           :sitemap-sort-files anti-chronologically))))

(after! org
  (defun my/lab-journal-generate-index ()
    "Genera search-index.json en el root del repo."
    (let* ((docs-dir (expand-file-name "~/Org/Lab-Journal-html/"))
           (output-file (expand-file-name "~/Org/search-index.json"))
           (files (directory-files-recursively docs-dir "\\.html$"))
           (entries
            (delq nil
                  (mapcar
                   (lambda (file)
                     (let* ((rel (file-relative-name file (expand-file-name "~/Org/")))
                            (parts (split-string rel "/"))
                            (year  (and (>= (length parts) 4) (nth 1 parts)))
                            (month (and (>= (length parts) 4) (nth 2 parts)))
                            (name  (file-name-sans-extension (file-name-nondirectory file)))
                            (title (replace-regexp-in-string "[-_]" " " name)))
                       (when (and year month
                                  (not (string= name "index")))
                         (format "{\"title\":\"%s\",\"url\":\"%s\",\"year\":\"%s\",\"month\":\"%s\"}"
                                 title rel year month))))
                   files))))
      (with-temp-file output-file
        (insert "[" (mapconcat #'identity entries ",") "]"))))

(after! org
  (require 'oc-csl)
  (setq org-cite-global-bibliography '("~/Org/references.bib"))
  (setq org-cite-export-processors
        '((html . (csl "chicago-author-date.csl"))
          (t    . (csl "chicago-author-date.csl"))))
  (setq org-cite-csl-styles-dir "~/Zotero/styles/"))

(defun my/lab-journal-export-and-push ()
  (interactive)
  (save-some-buffers t)
  (org-publish "lab-journal")
  (my/lab-journal-generate-index)
  (async-shell-command
   (concat
    "cd " (expand-file-name org-directory) " && "
    "npx pagefind --site Lab-Journal-html --output-path Lab-Journal-html/pagefind && "
    "git add . && "
    "git diff --cached --quiet || "
    "(git commit -m \"Auto export for the Lab Journal.\" && git push)")))

(defun my/lab-journal-full-rebuild ()
  (interactive)
  (org-publish-remove-all-timestamps)
  (org-publish "lab-journal" t)
  (my/lab-journal-generate-index)
  (async-shell-command
   (concat
    "cd " (expand-file-name org-directory) " && "
    "npx pagefind --site Lab-Journal-html --output-path Lab-Journal-html/pagefind")))

(map! :leader
        :prefix ("n j" . "journal")
        :desc "Export Lab Journal"
        "p" #'my/lab-journal-export-and-push
        :desc "Full rebuild Lab Journal"
        "R" #'my/lab-journal-full-rebuild))

(setq org-roam-directory "~/Org")

(after! org-noter
  (setq org-noter-notes-search-path '("~/Org/Notes/References")
        org-noter-auto-save-last-location t
        org-noter-doc-split-fraction '(0.6 . 0.4)  ; PDF izquierda, notas derecha
        org-noter-always-create-frame nil
        org-noter-kill-frame-at-session-end nil))

(after! citar
  (setq citar-bibliography '("~/Org/references.bib")) ;; Tu .bib exportado por Zotero
  (setq citar-library-paths '("~/Zotero/storage")) ;; Donde Zotero guarda los PDFs
  (setq citar-notes-paths '("~/Org/Notes/References")) ;; Donde se crearán/guardarán las notas de org-noter
  (setq citar-file-note-org-include '(org-id org-noter-document-property))) ;; Formato del nombre del archivo de nota

(after! (citar org-noter)
  ;; Función que crea la nota con el template correcto para org-noter
  (defun my/citar-open-noter (citekey)
    "Abre o crea una nota org-noter para CITEKEY."
    (let* ((entry (citar-get-entry citekey))
           (title (citar-get-value "title" entry))
           (file  (expand-file-name
                   (concat citekey ".org")
                   "~/Org/Notes/References"))
           (pdf   (car (citar-get-files citekey))))
      (find-file file)
      (when (= (buffer-size) 0)
        ;; Crea el archivo con el header de org-noter si no existe
        (insert (format "#+title: %s\n#+author: \n\n* %s\n:PROPERTIES:\n:NOTER_DOCUMENT: %s\n:END:\n\n"
                        title title (or pdf ""))))
      (org-noter)))

  ;; Reemplaza la acción de "abrir nota" en citar por la nuestra
  (setq citar-open-note-function #'my/citar-open-noter))

(after! citar
  (setq completion-ignore-case t))

(after! pdf-tools
  (setq-default pdf-view-display-size 'fit-page))
