doom-config/Linux Mint/config.org
** Entornos virtuales
Para el manejo de entornos virtuales usamos =pyvenv= antes de correr ~M-x run-python~.
#+begin_src emacs-lisp
(use-package! pyvenv
  :config
  (pyvenv-mode 1)
  (unless pyvenv-virtual-env (pyvenv-activate (expand-file-name "~/.venv"))))
#+end_src

Vamos a seguir el siguiente esquema:

#+begin_src text :tangle no
Sistema (Mint)
├── Python del sistema 3.12.3 (aislado)
├── pipx (accesible globalmente)
│   ├── black
│   └── ipython
└── Emacs
    ├── ~/.venv (activo por defecto)
    └── venv específicos por proyecto
#+end_src

** Consola interactiva
Configuramos para utilizar Ipython por defecto, y así tener acceso a la consola interactiva como REPL.

#+begin_src emacs-lisp
(after! python
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "-i --simple-prompt"))
#+end_src

** Encoding
Al correr Ipython el encoding por defecto es =cp1252= y hace cosas raras con los tildes.

#+begin_src emacs-lisp
;; (set-language-environment "UTF-8")
;; (prefer-coding-system 'utf-8)

;; (set-default-coding-systems 'utf-8)
;; (set-terminal-coding-system 'utf-8)
;; (set-keyboard-coding-system 'utf-8)
;; (set-selection-coding-system 'utf-8)

;; (setenv "PYTHONUTF8" "1")
;; (setenv "IPYTHONIOENCODING" "utf-8")
#+end_src
