doom-config/Linux Mint/config.el

(use-package! pyvenv
  :config
  (pyvenv-mode 1)
  (unless pyvenv-virtual-env (pyvenv-activate (expand-file-name "~/.venv"))))

(after! python
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "-i --simple-prompt"))

;; (set-language-environment "UTF-8")
;; (prefer-coding-system 'utf-8)

;; (set-default-coding-systems 'utf-8)
;; (set-terminal-coding-system 'utf-8)
;; (set-keyboard-coding-system 'utf-8)
;; (set-selection-coding-system 'utf-8)

;; (setenv "PYTHONUTF8" "1")
;; (setenv "IPYTHONIOENCODING" "utf-8")
